Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: **Video**: H.264, H.265/HEVC, VP8, VP9, AV1, MPEG-4, WebM, and many more
it_it: **Video**: H.264, H.265/HEVC, VP8, VP9, AV1, MPEG-4, WebM e molti altri

source: **Visual cohesiveness** that makes models appear naturally placed in their environment
it_it: **Coesione visiva** che fa apparire i modelli naturalmente inseriti nel loro ambiente

source: **We highly recommend you enable Arm-2D acceleration for LVGL** when:
it_it: **Consigliamo vivamente di abilitare l'accelerazione Arm-2D per LVGL** quando:

source: **Web streams**: ``http://example.com/stream.webm``, ``https://secure.example.com/video.mp4``
it_it: **Stream web**: ``http://example.com/stream.webm``, ``https://secure.example.com/video.mp4``

source: **XML support for LVGL Pro**.
it_it: **Supporto XML per LVGL Pro**.

source: **create**: The screen is created dynamically, and when leaving the screen, it is deleted, so all changes are lost (unless they are saved in ``subjects``).
it_it: **create**: La schermata viene creata dinamicamente e, quando si abbandona la schermata, viene eliminata, quindi, tutte le modifiche vengono perse (a meno che non vengano salvate in ``subjects``).

source: **cross direction**: the direction perpendicular to the **main direction**
it_it: **direzione trasversale**: la direzione perpendicolare alla **direzione principale**

source: **fbdev** - LVGL can create a display for ``/dev/fb*`` devices.
it_it: **fbdev** - LVGL può creare un display per i dispositivi ``/dev/fb*``.

source: **free (FR) units**: if a track's size is set in ``FR units`` it will grow to fill the remaining space in the parent Widget (container), in proportion with other tracks that have non-zero FR-unit values.
it_it: **free (FR) units**: se la dimensione di una track è impostata in ``unità FR``, questa aumenterà fino a riempire lo spazio rimanente nel Widget padre (contenitore), in proporzione alle altre tracce che hanno valori di unità FR diversi da zero.

source: **gap**: the space between rows and columns or the items on a track
it_it: **gap**: lo spazio tra righe e colonne o tra gli elementi di una track

source: **glTF + 3D Support**.
it_it: **Supporto glTF + 3D**.

source: **glTF** (GL Transmission Format) is a royalty-free specification for efficient transmission and loading of 3D scenes and models.
it_it: **glTF** (GL Transmission Format) è una specifica royalty-free per la trasmissione e il caricamento efficienti di scene e modelli 3D.

source: **grow**: if set on an item it will "grow" to fill the remaining space in the track.
it_it: **grow** [crescita]: se impostato su un elemento, "crescerà" per riempire lo spazio rimanente nella traccia.

source: **images**: it contains the images that can be flashed or deployed to the target device.
it_it: **images**: contiene le immagini che possono essere flashate o distribuite sul dispositivo target.

source: **inherit**: This line indicates that the recipe uses the ``cmake`` class, which provides functionality for building projects that use CMake as their build system.
it_it: **inherit**: Questa riga indica che la ricetta utilizza la classe ``cmake``, che fornisce funzionalità per la creazione di progetti che utilizzano CMake come sistema di build.

source: **input/uinput touchscreen** - LVGL can create an indev(s) for touch devices that use the NuttX input/uinput system.
it_it: **input/uinput touchscreen** - LVGL può creare uno o più indev per dispositivi touch che utilizzano il sistema input/uinput NuttX.

source: **lcd** - LVGL can create a display for ``/dev/lcd*`` devices.
it_it: **lcd** - LVGL può creare un display per i dispositivi ``/dev/lcd*``.

source: **libjpeg-turbo** is an LVGL interface to the libjpeg-turbo library --- a JPEG image codec that uses SIMD instructions to accelerate baseline JPEG compression and decompression on x86, x86-64, Arm, PowerPC, and MIPS systems, as well as progressive JPEG compression on x86, x86-64, and Arm systems.
it_it: **libjpeg-turbo** è un'interfaccia LVGL alla libreria libjpeg-turbo, un codec di immagini JPEG che utilizza istruzioni SIMD per accelerare la compressione e la decompressione JPEG di base su sistemi x86, x86-64, Arm, PowerPC e MIPS, nonché la compressione JPEG progressiva su sistemi x86, x86-64 e Arm.

source: **libpng** is an LVGL interface to the official PNG reference library, which supports almost all PNG features, is extensible, and has been extensively tested for over 28 years.
it_it: **libpng** è un'interfaccia LVGL per la libreria di riferimento PNG ufficiale, che supporta quasi tutte le funzionalità PNG, è estensibile ed è stata ampiamente testata per oltre 28 anni.

source: **libuv** - LVGL has support for using libuv as its event loop manager.
it_it: **libuv** - LVGL supporta l'utilizzo di libuv come "event loop manager".

source: **libwebp** is an LVGL interface to the WebP image format --- a modern image format that provides superior lossless and lossy compression for images on the web.
it_it: **libwebp** è un'interfaccia LVGL per il formato immagine WebP, un formato immagine moderno che offre una compressione lossless e lossy superiore per le immagini sul web.

source: **littlefs** is a little fail-safe filesystem library designed for microcontrollers.
it_it: **littlefs** è una piccola libreria di file system a prova di errore progettata per microcontrollori.

source: **load**: Just loads an already existing screen.
it_it: **load**: Carica semplicemente una schermata già esistente.

source: **lv_micropython** already contains these drivers:
it_it: **lv_micropython** contiene già i seguenti driver:

source: **lvgljs** depends on following excellent work:
it_it: **lvgljs** dipende dal seguente eccellente lavoro:

source: **main direction**: row or column, the direction in which multiple items are placed first
it_it: **direzione principale**: riga o colonna, la direzione in cui vengono posizionati per primi più elementi

source: **require**: This line includes another configuration file, ``lv-conf.inc``, which likely contains additional configuration options or variables specific to the LVGL library.
it_it: **require**: Questa riga include un altro file di configurazione, ``lv-conf.inc``, che probabilmente contiene opzioni di configurazione aggiuntive o variabili specifiche della libreria LVGL.

source: **rmp/deb/ipk**: These folders contain the individual software packages generated during the build, in the specified package format (RPM, DEB, or IPK).
it_it: **rmp/deb/ipk**: Queste cartelle contengono i singoli pacchetti software generati durante la compilazione, nel formato di pacchetto specificato (RPM, DEB o IPK).

source: **sdk**: This subdirectory contains Software Development Kits (SDKs) that you can use to cross-compile applications for your target system.
it_it: **sdk**: Questa sottodirectory contiene i Software Development Kit (SDK) che è possibile utilizzare per la cross-compilazione delle applicazioni per il sistema di target.

source: **tracks**: rows or columns
it_it: **track** [tracce]: righe o colonne

source: **wrap**: if there is no more space in the track, a new track is started
it_it: **wrap**: se non c'è più spazio nella traccia, ne viene iniziata una nuova

source: *Class Data:* Abstracts common build information (e.g. how to build a Linux kernel).
it_it: *Dati di Classi:* Estraggono informazioni di build comuni (ad esempio, come compilare un kernel Linux).

source: *Configuration Data:* Defines machine-specific settings, policy decisions, and so forth.
it_it: *Dati di Configurazione:* Definiscono impostazioni specifiche della macchina, decisioni sulle policy e così via.

source: *Custom events* are added by the user and are never sent by LVGL.
it_it: Gli *eventi personalizzati* vengono aggiunti dall'utente e non vengono mai inviati da LVGL.

source: *Display* refers to the actual hardware.
it_it: *Display* si riferisce all'hardware effettivo.

source: *Memory usage may vary depending on architecture, compiler and build options.*
it_it: *L'utilizzo della memoria può variare a seconda dell'architettura, del compilatore e delle opzioni di build.*

source: *Navigate* and *Edit* modes are used to solve this problem with encoders.
it_it: Le modalità *Navigate* ed *Edit* vengono utilizzate per risolvere questo problema con gli encoder.

source: *Padding* makes the series area smaller.
it_it: Il *Padding* riduce l'area della serie.

source: *Recipes:* Provides details about particular pieces of software.
it_it: *Ricette:* Forniscono dettagli su particolari componenti software.

source: *while(1)* of *main()* function, or
it_it: *while(1)* della funzione *main()*, o

source: *y invert* is disabled by default.
it_it: L'*inversione della y* è disabilitata per default.

source: - First item description - If you want to span multiple lines, indent subsequent
it_it: - Descrizione del primo elemento - Per estendere l'elenco su più righe, rientrare le

source: - If the comparison fails, an image with `_err` suffix is saved for inspection.
it_it: - Se il confronto fallisce, viene salvata un'immagine con suffisso `_err` per l'ispezione.

source: - If the image doesn't exist, it is created.
it_it: - Se l'immagine non esiste, viene creata.

source: - If you want to include multiple paragraphs and/or code blocks under a
it_it: - Per includere più paragrafi e/o blocchi di codice sotto una

source: - level 2 item 1: text
it_it: - livello 2 elemento 1: testo

source: - level 2 item 2: text
it_it: - livello 2 elemento 2: testo

source: ... then it should look like this afterwards:
it_it: ... allora dovrebbe apparire così:

source: ...and so on
it_it: ...e così via

source: ...you can see that in order to clip the children, two intermediate layer work areas have to be temporarily allocated, each having a height equal to the radius-style value currently held by the parent.
it_it: ...si può notare che per il clipping dei figli, è necessario allocare temporaneamente due aree di lavoro intermedie, ciascuna con un'altezza pari al valore di "radius-style" attualmente assegnato al genitore.

source: 0 means to top/left side, 255 the bottom/right side, 128 the center, and so on
it_it: 0 indica il lato superiore/sinistro, 255 il lato inferiore/destro, 128 il centro e così via.

source: 0 or more background division lines (horizontal and vertical),
it_it: 0 o più linee di divisione di sfondo (orizzontali e verticali),

source: 0 or more cursors (you can add or remove them at any time),
it_it: 0 o più cursori (è possibile aggiungerli o rimuoverli in qualsiasi momento),

source: 0 or more data series (you can add or remove them at any time),
it_it: 0 o più serie di dati (è possibile aggiungerle o rimuoverle in qualsiasi momento),

source: 1 Jan, 2025
it_it: 1 Gen, 2025

source: 1 Jun, 2021
it_it: 1 Giu, 2021

source: 1 Jun, 2022
it_it: 1 Giu, 2022

source: 1 at least blank line above all lower-level section headings.
it_it: almeno 1 riga vuota sopra tutte le intestazioni di sezione di livello inferiore.

source: 1, 3 and 4 are independent of the :ref:`active_screen` and they will be shown (if they contain anything that is visible) regardless of which screen is the :ref:`active_screen`.
it_it: 1, 3 e 4 sono indipendenti da :ref:`active_screen` e verranno visualizzati (se contengono qualcosa di visibile) indipendentemente da quale schermo sia :ref:`active_screen`.

source: 10% red: 0--10% fully red
it_it: 10% rosso: 0-10% completamente rosso

source: 128KB internal SRAM
it_it: 128KB SRAM interna

source: 128MB external
it_it: 128MB esterna

source: 128MB external QSPI NAND flash
it_it: 128MB QSPI NAND flash esterna

source: 128MB internal DDR3L-SDRAM
it_it: 128MB DDR3L-SDRAM interna

source: 150k pixels: 2 cores
it_it: 150k pixel: 2 core

source: 16, 32 or 64 bit microcontroller or processor
it_it: Microcontrollore o processore a 16, 32 o 64 bit

source: 1872KB internal
it_it: 1872KB interna

source: 1MB internal SDRAM
it_it: 1MB SDRAM interna

source: 1MB internal SRAM
it_it: 1MB SRAM interna

source: 1MB internal flash
it_it: 1MB flash interna

source: 2 Y axes and 2 X axes (the latter are used with SCATTER charts)
it_it: 2 assi Y e 2 assi X (questi ultimi vengono utilizzati con i grafici SCATTER [a dispersione])

source: 2 blank lines above "Sub Section" headings, and
it_it: 2 righe vuote sopra le intestazioni di "Sottosezione" e

source: 200k pixels: 3 cores (above 186k pixels, 3 cores are used)
it_it: 200k pixel: 3 core (oltre i 186k pixel, vengono utilizzati 3 core)

source: 256 (LV_SCALE_NONE) means no zoom, 512 doubles the size, and 128 halves it.
it_it: 256 (LV_SCALE_NONE) significa nessuno zoom, 512 raddoppia le dimensioni e 128 le dimezza.

source: 2D Direct Memory Access (DMA2D) Support
it_it: Supporto per la Direct Memory Access 2D (DMA2D)

source: 2MB internal SRAM
it_it: 2MB SRAM interna

source: 2MB internal flash
it_it: 2MB flash interna

source: 3 June, 2025
it_it: 3 giugno 2025

source: 3 June, 2026
it_it: 3 giugno 2026

source: 3 points for the triangle's vertices.
it_it: 3 punti per i vertici del triangolo.

source: 300k pixels: 4 cores (above 279k pixels, 4 cores are used)
it_it: 300k pixel: 4 core (oltre i 279k pixel, vengono utilizzati 4 core)

source: 30k pixels: 1 core
it_it: 30k pixel: 1 core

source: 32 and 16 bit :c:macro:`LV_COLOR_DEPTH` is supported.
it_it: È supportato :c:macro:`LV_COLOR_DEPTH` a 32 e 16 bit.

source: 32MB external QSPI NOR flash
it_it: 32MB QSPI NOR flash esterna

source: 32MB external QSPI flash
it_it: 32MB QSPI flash esterna

source: 375k pixels: 4 cores
it_it: 375k pixel: 4 core

source: 3D Texture (lv_3dtexture)
it_it: Texture 3D (lv_3dtexture)

source: 3D Texture has no special event handling.
it_it: La Texture 3D non ha una gestione speciale degli eventi.

source: 3D texture widgets are used to embed an external 3D graphics library's "texture" primitive into an LVGL UI.
it_it: I widget texture 3D vengono utilizzati per incorporare la primitiva "texture" di una libreria grafica 3D esterna in un'interfaccia utente LVGL.

source: 3D/glTF Support
it_it: Supporto 3D/glTF

source: 3rd-Party Libraries
it_it: Librerie di Terze Parti

source: 4 :ref:`display_screen_layers` automatically created with each display
it_it: 4 :ref:`display_screen_layers` creati automaticamente con ogni display

source: 4 internal axes, any of which can be used to specify scale for a data series,
it_it: 4 assi interni, ognuno dei quali può essere utilizzato per specificare la scala per una serie di dati,

source: 4MB internal SRAM
it_it: 4MB SRAM interna

source: 6 July, 2022
it_it: 6 Lug, 2022

source: 60% green: 10--60% transition from red to green, 60% is fully green
it_it: 60% verde: transizione dal 10 al 60% da rosso a verde, il 60% è completamente verde

source: 64-bit only, runs on x86_64 and ARMv8
it_it: Solo a 64 bit, funziona su x86_64 e ARMv8

source: 640kB internal SRAM
it_it: 640kB SRAM interna

source: 64MB external SDRAM
it_it: 64MB SDRAM esterna

source: 64MB external octo-SPI flash
it_it: 64MB octo-SPI flash esterna

source: 65% blue: fast transition from green to blue between 60%--65%.
it_it: 65% blu: transizione rapida dal verde al blu tra 60%--65%.

source: 8x8 Pixel Tiles
it_it: Riquadri 8x8 Pixel

source: 90k pixels: 1 core
it_it: 90k pixel: 1 core

source: 95k pixels: 2 cores (above 93k pixels, 2 cores are used)
it_it: 95k pixel: 2 core (oltre i 93k pixel, vengono utilizzati 2 core)

source: :c:macro:`LV_COLOR_DEPTH` ``16``: RGB565 (2 bytes/pixel)
it_it: :c:macro:`LV_COLOR_DEPTH` ``16``: RGB565 (2 byte/pixel)

source: :c:macro:`LV_COLOR_DEPTH` ``1``: I1 (1 bit/pixel) Only support for horizontal mapped buffers.
it_it: :c:macro:`LV_COLOR_DEPTH` ``1``: I1 (1 bit/pixel) Supporto solo per buffer con mappatura orizzontale.

source: :c:macro:`LV_COLOR_DEPTH` ``24``: RGB888 (3 bytes/pixel)
it_it: :c:macro:`LV_COLOR_DEPTH` ``24``: RGB888 (3 byte/pixel)

source: :c:macro:`LV_COLOR_DEPTH` ``32``: XRGB8888 (4 bytes/pixel)
it_it: :c:macro:`LV_COLOR_DEPTH` ``32``: XRGB8888 (4 byte/pixel)

source: :c:macro:`LV_COLOR_DEPTH` ``8``: L8 (1 bytes/pixel)
it_it: :c:macro:`LV_COLOR_DEPTH` ``8``: L8 (1 byte/pixel)

source: :c:macro:`LV_COLOR_DEPTH` to set LVGL's default color depth
it_it: :c:macro:`LV_COLOR_DEPTH` per impostare la profondità di colore predefinita di LVGL

source: :c:macro:`LV_DRAW_LABEL_NO_TXT_SEL` indicates no text selected.
it_it: :c:macro:`LV_DRAW_LABEL_NO_TXT_SEL` indica che non è stato selezionato alcun testo.

source: :c:macro:`LV_FONT_DEJAVU_16_PERSIAN_HEBREW`: 16 px font with normal range + Hebrew, Arabic, Persian letters and all their forms
it_it: :c:macro:`LV_FONT_DEJAVU_16_PERSIAN_HEBREW`: Font da 16 px con intervallo normale + lettere ebraiche, arabe, persiane e tutte le loro forme

source: :c:macro:`LV_FONT_MONTSERRAT_28_COMPRESSED`: Same as normal 28 px font but stored as a :ref:`fonts_compressed` with 3 bpp
it_it: :c:macro:`LV_FONT_MONTSERRAT_28_COMPRESSED`: Uguale al font normale da 28 px, ma memorizzato come :ref:`fonts_compressed` con 3 bpp

source: :c:macro:`LV_FONT_SOURCE_HAN_SANS_SC_16_CJK`: 16 px font with normal range plus 1000 of the most common CJK radicals
it_it: :c:macro:`LV_FONT_SOURCE_HAN_SANS_SC_16_CJK`: Font da 16 px con intervallo normale più 1000 dei radicali CJK più comuni

source: :c:macro:`LV_FONT_UNSCII_16`: 16 px pixel perfect font with only ASCII characters
it_it: :c:macro:`LV_FONT_UNSCII_16`: Font pixel perfect da 16 px con solo caratteri ASCII

source: :c:macro:`LV_FONT_UNSCII_8`: 8 px pixel perfect font with only ASCII characters
it_it: :c:macro:`LV_FONT_UNSCII_8`: Font pixel perfect da 8 px con solo caratteri ASCII

source: :c:macro:`LV_FREETYPE_CACHE_FT_GLYPH_CNT` Maximum number of cached glyphs., etc.
it_it: :c:macro:`LV_FREETYPE_CACHE_FT_GLYPH_CNT` Numero massimo di glifi memorizzati nella cache, ecc.

source: :c:macro:`LV_GRID_CONTENT` sets size to fit the largest child on this track
it_it: :c:macro:`LV_GRID_CONTENT` imposta la dimensione in modo che si adatti all'elemento figlio più grande di questa track

source: :c:macro:`LV_LOG_LEVEL_ERROR`: Log only critical issues, where the system may fail.
it_it: :c:macro:`LV_LOG_LEVEL_ERROR`: Log dei soli problemi critici, in cui il sistema potrebbe non funzionare.

source: :c:macro:`LV_LOG_LEVEL_INFO`: Log important events.
it_it: :c:macro:`LV_LOG_LEVEL_INFO`: Log di eventi importanti.

source: :c:macro:`LV_LOG_LEVEL_NONE`: Do not log anything.
it_it: :c:macro:`LV_LOG_LEVEL_NONE`: Non logga nulla.

source: :c:macro:`LV_LOG_LEVEL_TRACE`: A lot of logs to give detailed information
it_it: :c:macro:`LV_LOG_LEVEL_TRACE`: Molti log per fornire informazioni dettagliate

source: :c:macro:`LV_LOG_LEVEL_USER`: Log only custom log messages added by the user.
it_it: :c:macro:`LV_LOG_LEVEL_USER`: Log dei soli messaggi di log personalizzati aggiunti dall'utente.

source: :c:macro:`LV_LOG_LEVEL_WARN`: Log if something unwanted happened but didn't cause a problem.
it_it: :c:macro:`LV_LOG_LEVEL_WARN`: Log se si è verificato un evento indesiderato che non ha causato problemi.

source: :c:macro:`LV_MEM_SIZE` to set the maximum RAM available to LVGL
it_it: :c:macro:`LV_MEM_SIZE` per impostare la RAM massima disponibile per LVGL

source: :c:macro:`LV_PROFILER_BEGIN_TAG`: Profiler start point function with custom tag.
it_it: :c:macro:`LV_PROFILER_BEGIN_TAG`: Funzione punto di inizio del profiler con tag personalizzato.

source: :c:macro:`LV_PROFILER_BEGIN`: Profiler start point function.
it_it: :c:macro:`LV_PROFILER_BEGIN`: Funzione punto di inizio del profiler.

source: :c:macro:`LV_PROFILER_END_TAG`: Profiler end point function with custom tag.
it_it: :c:macro:`LV_PROFILER_END_TAG`: Funzione punto di fine del profiler con tag personalizzato.

source: :c:macro:`LV_PROFILER_END`: Profiler end point function.
it_it: :c:macro:`LV_PROFILER_END`: Funzione punto di fine del profiler.

source: :c:macro:`LV_PROFILER_INCLUDE`: Provides a header file for the profiler function.
it_it: :c:macro:`LV_PROFILER_INCLUDE`: Fornisce un file header per la funzione profiler.

source: :c:macro:`LV_PROPERTY_ID2` (for paired values -- see :ref:`Paired Values` below)`; bits ``<31:28>`` contain the type for the property's 1st value, bits ``<27:24>`` contain the type for the 2nd value, and bits ``<23:0>`` contain the property ID.
it_it: :c:macro:`LV_PROPERTY_ID2` (per valori accoppiati -- vedere :ref:`Paired Values` di seguito); i bit ``<31:28>`` contengono il tipo per il primo valore della proprietà, i bit ``<27:24>`` contengono il tipo per il secondo valore e i bit ``<23:0>`` contengono l'ID della proprietà.

source: :c:macro:`LV_PROPERTY_ID` (for single values -- see :ref:`Single Values` below)`; bits ``<31:28>`` contain the property's value type and bits ``<27:0>`` contain the property ID.
it_it: :c:macro:`LV_PROPERTY_ID` (per valori singoli -- vedere :ref:`Single Values` di seguito); i bit ``<31:28>`` contengono il tipo di valore della proprietà e i bit ``<27:0>`` contengono l'ID della proprietà.

source: :c:macro:`LV_ST_LTDC_USE_DMA2D_FLUSH` can be enabled to use DMA2D to flush partial buffers in parallel with other LVGL tasks, whether or not OS is enabled.
it_it: :c:macro:`LV_ST_LTDC_USE_DMA2D_FLUSH` può essere abilitato per utilizzare DMA2D per svuotare i buffer parziali in parallelo con altre attività LVGL, indipendentemente dal fatto che il sistema operativo sia abilitato o meno.

source: :c:macro:`LV_ST_LTDC_USE_DMA2D_FLUSH` will be have no effect if rotation is used.
it_it: :c:macro:`LV_ST_LTDC_USE_DMA2D_FLUSH` non avrà alcun effetto se si utilizza la rotazione.

source: :c:macro:`LV_SYMBOL_BACKSPACE` Delete character to the left.
it_it: :c:macro:`LV_SYMBOL_BACKSPACE` Cancella il carattere a sinistra.

source: :c:macro:`LV_SYMBOL_CLOSE` or :c:macro:`LV_SYMBOL_KEYBOARD` Send :cpp:enumerator:`LV_EVENT_CANCEL` to the assigned Text Area.
it_it: :c:macro:`LV_SYMBOL_CLOSE` o :c:macro:`LV_SYMBOL_KEYBOARD` Inviano :cpp:enumerator:`LV_EVENT_CANCEL` all'area di testo assegnata.

source: :c:macro:`LV_SYMBOL_LEFT` Move cursor left.
it_it: :c:macro:`LV_SYMBOL_LEFT` Sposta il cursore a sinistra.

source: :c:macro:`LV_SYMBOL_NEW_LINE` New line.
it_it: :c:macro:`LV_SYMBOL_NEW_LINE` Nuova riga.

source: :c:macro:`LV_SYMBOL_OK` Send :cpp:enumerator:`LV_EVENT_READY` to the assigned Text Area.
it_it: :c:macro:`LV_SYMBOL_OK` Invia :cpp:enumerator:`LV_EVENT_READY` alla Text Area assegnata.

source: :c:macro:`LV_SYMBOL_RIGHT` Move cursor right.
it_it: :c:macro:`LV_SYMBOL_RIGHT` Sposta il cursore a destra.

source: :c:macro:`LV_USE_DAVE2D` to enable the GPU
it_it: :c:macro:`LV_USE_DAVE2D` per abilitare la GPU

source: :c:macro:`LV_USE_GENERIC_MIPI` is automatically enabled when a compatible driver is enabled.
it_it: :c:macro:`LV_USE_GENERIC_MIPI` viene abilitato automaticamente quando viene abilitato un driver compatibile.

source: :c:macro:`LV_USE_LOG` must equate to a non-zero value
it_it: :c:macro:`LV_USE_LOG` deve essere uguale a un valore diverso da zero

source: :c:macro:`SDK_OS_FREE_RTOS` symbol needs to be defined so that FreeRTOS driver osal implementation will be enabled.
it_it: Il simbolo :c:macro:`SDK_OS_FREE_RTOS` deve essere definito in modo che l'implementazione "osal" [OS Abstraction Layer] del driver FreeRTOS sia abilitata.

source: :cpp:enumerator:`LV_ARCLABEL_DIR_CLOCKWISE` Text flows in a clockwise direction along the arc.
it_it: :cpp:enumerator:`LV_ARCLABEL_DIR_CLOCKWISE` Il testo scorre in senso orario lungo l'arco.

source: :cpp:enumerator:`LV_ARCLABEL_DIR_COUNTERCLOCKWISE` Text flows in a counter-clockwise direction along the arc.
it_it: :cpp:enumerator:`LV_ARCLABEL_DIR_COUNTERCLOCKWISE` Il testo scorre in senso antiorario lungo l'arco.

source: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_CENTER` Centers text along the arc.
it_it: :cpp:enumerator:`LV_ARCLABEL_TEXT_ALIGN_CENTER` Centra il testo lungo l'arco.
